user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/inductionBlock3D/system/region_fluid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance           1e-6;

pointSync                true;

patchInfo
(
    {
        name             trackedSurface;
        constructFrom    set;
        set              faceSet_geometry_trackedSurface;

        dictionary
        {
            type         patch;
        }
    }

    {
        name             bottomWall;
        constructFrom    set;
        set              faceSet_geometry_bottomWall;

        dictionary
        {
            type         wall;
        }
    }

    {
        name             sideWall;
        constructFrom    set;
        set              faceSet_geometry_sideWall;

        dictionary
        {
            type         wall;
        }
    }
);

// ************************************************************************* //
