user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/inductionBlock3D/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

geometry_fluid.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_buffer.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_below.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_boundary_trackedSurface.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_boundary_sideWall.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_boundary_bottomWall.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}


geometry_boundary_fixedMesh.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0 : selects no edges
        // - 180: selects all edges
        includedAngle 90;
    }

    // Write options
    // Write features to obj format for postprocessing
    writeObj yes;
}

// ************************************************************************* //
